Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:        
  ~ update in-place

Terraform will perform the following actions:

  # vra_image_profile.server_2022_gui_az1 will be updated in-place
  ~ resource "vra_image_profile" "server_2022_gui_az1" {
        id                 = "80948167-4bc2-4bb5-ae6e-828bea7edb81-b101f148-5871-43b3-96bf-f070dd59c2a1"
        name               = "server_2022_gui"
        # (6 unchanged attributes hidden)

      - image_mapping {
          - description        = "hosting_server_2022_gui_az1" -> null
          - external_id        = "50076391-72cc-1649-34fe-aa87513c794f" -> null
          - external_region_id = "Datacenter:datacenter-21" -> null
          - image_id           = "0efdf212ea2780cbe071b16a5ba26f72fb80222e" -> null
          - image_name         = "hosting_server_2022_gui_az1" -> null
          - name               = "server_2022_gui" -> null
          - os_family          = "WINDOWS" -> null
          - private            = false -> null
            # (3 unchanged attributes hidden)
        }
      + image_mapping {
          + description        = (known after apply)
          + external_id        = (known after apply)
          + external_region_id = (known after apply)
          + image_id           = "0efdf212ea2780cbe071b16a5ba26f72fb80222e"
          + name               = "server_2022_gui"
          + organization       = (known after apply)
          + os_family          = (known after apply)
          + owner              = (known after apply)
          + private            = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # vra_image_profile.server_2022_gui_az2 will be updated in-place
  ~ resource "vra_image_profile" "server_2022_gui_az2" {
        id                 = "80948167-4bc2-4bb5-ae6e-828bea7edb81-e54ff1c3-55fc-425c-a522-21b3aeaa5805"
        name               = "server_2022_gui"
        # (6 unchanged attributes hidden)

      - image_mapping {
          - description        = "hosting_server_2022_gui_az2" -> null
          - external_id        = "5007a1e7-b716-ad10-4cf4-d5c1b61de5ad" -> null
          - external_region_id = "Datacenter:datacenter-26" -> null
          - image_id           = "73d21b87ed40276739cfe39038302ad222d30f28" -> null
          - image_name         = "hosting_server_2022_gui_az2" -> null
          - name               = "server_2022_gui" -> null
          - os_family          = "WINDOWS" -> null
          - private            = false -> null
            # (3 unchanged attributes hidden)
        }
      + image_mapping {
          + description        = (known after apply)
          + external_id        = (known after apply)
          + external_region_id = (known after apply)
          + image_id           = "73d21b87ed40276739cfe39038302ad222d30f28"
          + name               = "server_2022_gui"
          + organization       = (known after apply)
          + os_family          = (known after apply)
          + owner              = (known after apply)
          + private            = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.